Revit 2026 API

# BuiltInFailuresExportFailures Class

---

Failures about ExportFailures.

SystemObject Autodesk.Revit.DBBuiltInFailuresExportFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExportFailures
```
```vb
Public NotInheritable Class ExportFailures
```
```cpp
public ref class ExportFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExportFailures = class end
```

The BuiltInFailuresExportFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCFatalExportError | There has been an unrecoverable error during export. Export will now be aborted. |
|  | IFCFatalToolkitExportError | There has been an unrecoverable error during export. Export will now be aborted. |
|  | IFCGenericExportWarning | Unexpected errors occurred while exporting these elements to the IFC file. |
|  | SwitchToRasterProcessingInsteadOfVectorWarning | Some of the views have been switched to raster processing though vector processing is selected. |

#### Reference

Autodesk.Revit.DB Namespace